Autodesk.Revit.DB.ContentNode.GetAsset
Returns an an instance of an Asset object, which contains definitions of the content node.
Remarks:
Properties and attributes of the node can be accessed using the standard interface of the Asset class.
Since:
2014

Autodesk.Revit.DB.ContentNode.GetTransform
A transformation matrix associated with the node.
Since:
2014

Autodesk.Revit.DB.ContentNode
This is a class representing a generic content node in a model-exporting process.
Remarks:
Members of this class implement properties and methods
common to all content classes, such as RPC and Light nodes.
Attributes of a content note can be accessed via an Asset object.
Since:
2014